package cwbi_p;


public class Cwbi {
    private String b_name,      //имя ИБ
            b_conn,     //Соединение
            b_id,       //идентификатор, формат 6438be6e-bf5c-4ab4-bbd7-4dadcac72e69 - генерируем
            b_oib,      //порядок в списке баз, формат 27648.0000000001 - генерация
            b_folder,   //место в дереве каталогов
            b_tree,     //порядок в дереве - генерация
            b_external, //внешняя подключаемая запись конфигурации
            b_speed,    //скорость соединения
            b_type_conn,//тип соединения клиента
            b_wa,       //использование windows авторизации
            b_version;  //версия платформы


}
// логирование посмотреть